Revit 2026 API

# RevitLinkOptions(RevitLinkOptions) Constructor

---

Constructs a new copy of the input RevitLinkOptions object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RevitLinkOptions(
	RevitLinkOptions other
)
```
```vb
Public Sub New (
	other As RevitLinkOptions
)
```
```cpp
public:
RevitLinkOptions(
	RevitLinkOptions^ other
)
```
```fsharp
new :
        other : RevitLinkOptions -> RevitLinkOptions
```

#### Parameters

other RevitLinkOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RevitLinkOptions Class

RevitLinkOptions Overload

Autodesk.Revit.DB Namespace